export const monetaryUnit = {
  'yuan': 0,
  'jiao': 1,
  'fen' : 2,
}

export const getCategoryId = {
  '时时彩': 1,
  '快3': 2,
  '11选5': 3,
  '低频彩': 4,
  'PK10': 5,
  'PC蛋蛋': 6,
  '六合彩': 8,
}

export const digits = {
  // 特码包三
  特码: 3,
  // 连码
  四全: 4,
  三全: 3,
  三中: 3,
  二全: 2,
  二中: 2,
  特串: 2,
  // 连肖连尾
  二连: 2,
  三连: 3,
  四连: 4,
  五连: 5,
  // 自选不中
  五不: 5,
  六不: 6,
  七不: 7,
  八不: 8,
  九不: 9,
  十不: 10,
  十一: 11,
  十二: 12,
  // 合肖
  合肖: 2,
  // 中一
  五中: 5,
  六中: 6,
  七中: 7,
  八中: 8,
  九中: 9,
  十中: 10,
}

export const maxByPlay = {
  40: 3,
  48: 10,
  49: 6,
}

export const maxBySubPlay = {
  // 自选不中
  五不: 10,
  六不: 10,
  七不: 10,
  八不: 11,
  九不: 12,
  十不: 13,
  十一: 13,
  十二: 14,
  // 中一
  五中: 10,
  六中: 10,
  七中: 10,
  八中: 11,
  九中: 12,
  十中: 13,
}

// 走势图
export const typesList = {
  '1': ['基本走势', '定位胆', '三星组三', '和值'],
  '2': ['基本走势', '和值'],
  '3': ['基本走势', '定位胆'],
  '4': ['基本走势', '定位胆', '和值'],
  '5': ['基本走势', '定位胆1~5', '定位胆6~10', '冠亚和'],
  '6': ['基本走势', '特码'],
  '7': ['基本走势', '生肖', '色波'],
  '8': ['基本走势', '生肖', '色波'],
}
