export const TIMIING = {
  '时时彩': {
    '重庆时时彩': `10:00-22:00（72期），每10分钟一期，
22:00-02:00（48期），每5分钟一期，全天120期`,
    '天津时时彩': '09:10-22:55，每10分钟一期，全天84期',
    '分分时时彩': '00:00-00:00（次日），每1分钟一期，全天1440期',
    '三分时时彩': '00:00-00:00（次日），每3分钟一期，全天480期',
    '新疆时时彩': '10:10-02:00，每10分钟一期，全天96期',
    '北京时时彩': '09:05-23:55，每5分钟一期，全天179期',
  },
  '快3': {
    '安徽快三': '8:50-22:00，每10分钟一期，全天80期',
    '吉林快三': '8:30-21:35，每9分钟一期，全天87期',
    '广西快三': '9:38-22:28，每10分钟一期，全天78期',
    '湖北快三': '9:10-22:00，每10分钟一期，全天78期',
    '江苏快三': '8:40-22:00，每10分钟一期，全天82期',
  },
  '11选5': {
    '山东11选5': '8:37-22:57，每10分钟一期，全天87期',
    '上海11选5': '9:01-23:51，每10分钟一期，全天90期',
    '江西11选5': '9:11-23:01，每10分钟一期，全天84期',
    '广东11选5': '9:11-23:01，每10分钟一期，全天84期',
    '安徽11选5': '8:42-22:02，每10分钟一期，全天81期',
  },
  '低频彩': {
    '排列三': '一天一期，每天20:25开奖',
    '福彩3D': '一天一期，每天21:10开奖',
  },
  'PK10': {
    '北京PK拾': '9:07-23:57，每5分钟一期，全天179期',
    '极速PK拾': '全天24小时不间断开奖，每1分钟一期，全天1440期',
  },
  'PC蛋蛋': {
    '北京28': '9:05-23:55，每5分钟一期，全天179期',
    '幸运28': '08:00-06:00（次日），每2分钟一期，全天660期（06:00-08:00期间不开奖）',
  },
  '六合彩': {
    '香港六合彩': '每周开奖3期，通常于周二、周四及非赛马日的周六或周日21:35开奖',
    '极速六合彩': '每5分钟一期，24小时不间断开奖，全天开奖288期',
  },
}

export const INTRODUCTION_ONE = {
  '时时彩': [
    '时时彩投注区分为万位、千位、百位、十位和个位，各位号码范围为0～9。每期从各位上开出1个号码作为中奖号码，即开奖号码为5位数。时时彩玩法即是竞猜5位开奖号码的全部号码、部分号码或部分号码特征。',
    '时时彩中“复式”和“单式”的玩法规则相同，区别于单式需手动勾选位置、输入号码。',
    '时时彩分星彩玩法和大小单双玩法。星彩玩法包括五星、三星、二星和一星。',
  ],
  '快3': [
    '快3投注是指以三个号码组合为一注进行单式投注，每个投注号码为1-6共六个自然数中的任意一个，一组三个号码的组合称为一注。',
    '每期从3粒骰子的点数中随机开出3个号码作为开奖号。',
    '快3根据号码组合共分为“和值”、“三同号”、“二同号”、“三不同号”、“二不同号”、“三连号通选”投注方式，具体规定如下：',
  ],
  '11选5': [
    '11选5号码投注范围01-11，每期开出5个号码作为开奖号，顺序从左至右。',
    '11选5玩法即竞猜5位开奖号码的全部或部分号码。',
    '直选：将投注号码以惟一的排列方式进行投注。',
    '组选：将投注号码的所有排列方式作为一注投注号码进行投注，即号码顺序不限，开奖号中包含投注号码则中奖。示例：前三组选01 02 03，排列方式有01 02 03、01 03 02、02 01 03、02 03 01、03 01 02、03 02 01，共计6种。',
  ],
  '低频彩': [
    '每期从0-9中随机开出3个号码作为开奖号。',
    '玩法分为定位胆、不定胆和排列三，具体玩法说明如下：',
  ],
  'PK10': [
    '每期从01-10中随机开出10个号码作为当期开奖车号，顺序从左至右。',
    'PK拾采用排列式玩法。从左至右共有十个投注位置，排列顺序分别为一至十号位置，每个位置可从01-10的自然数中选择一个号码。',
    '先选择投注位置个数，投注位置个数最少一个、最多十个，在所选位置上从01-10的自然数中选择一个号码进行投注。',
    '若投注位置个数超过两个的，后选位置的投注号码不能与前面所有已选位置的投注号码相同。',
    '所选号码按位置顺序排序组成一组号码，该组号码即为一注PK拾投注号码。',
  ],
  'PC蛋蛋': [
    '投注号码竞猜范围为0-27，共28个号码。每期开出3个号码作为开奖号码，3个号码之和即为特码。',
    '玩法分为：豹子、混合、波色、特码和特码包三。',
  ],
  '六合彩': [
    '每期从01-49中随机开出7个号码，首6个号码为：正码，第7个号码为：特码。',
    '具体规则说明如下：',
  ],
}

export const INTRODUCTION_TWO = {
  '时时彩': {
    '直选：将投注号码以唯一的排列方式进行投注。': [],
    '组选：将投注号码的所有排列方式作为一注投注号码进行投注。示例：123，排列方式有123、132、213、231、312、321，共计6种。': [],
    '组选三：在三星组选中，如果一注组选号码的3个数字有两个数字相同，则有3种不同的排列方式，因而就有3个中奖机会，这种组选投注方式简称组选三。示例：112，排列方式有112、121、211。': [],
    '组选六：在三星组选中，如果一注组选号码的3个数字各不相同，则有6种不同的排列方式，因而就有6个中奖机会，这种组选投注方式简称组选六。示例：123，排列方式有123、132、213、231、312、321，共计6种。': [],
    '大小单双：号码0～9中，0～4为小，5～9为大，1、3、5、7、9为单，0、2、4、6、8为双。': [],
    '龙虎：根据指定位置上的号码数值比大小，首选号大于后选号为龙，小则为虎。': [],
    '跨度：对指定位置上的号码的最大最小数字差值进行投注。': [],
  },
  '快3': {
    '和值投注：是指对三个号码的和值进行投注，包括“和值4”至“和值17”投注。': [],
    '三同号投注：是指对三个相同的号码进行投注，具体分为：': [
      '三同号通选：是指对所有相同的三个号码（111、222、…、666）进行投注；',
      '三同号单选：是指从所有相同的三个号码（111、222、…、666）中任意选择一组号码进行投注。',
    ],
    '二同号投注：是指对两个指定的相同号码进行投注，具体分为：': [
      '三同号通选：是指对所有相同的三个号码（111、222、…、666）进行投注；',
      '三同号单选：是指从所有相同的三个号码（111、222、…、666）中任意选择一组号码进行投注。',
    ],
    '三不同号投注：是指对三个各不相同的号码进行投注。': [],
    '二不同号投注：是指对三个号码中两个指定的不同号码和一个任意号码进行投注。': [],
    '三连号通选投注：是指对所有三个相连的号码（仅限：123、234、345、456）进行投注。': [],
  },
  '11选5': {},
  '低频彩': {
    '定位胆：在任意位置上选1个号码，所选号与开奖号一致，且位置相同，即为中奖。': [],
    '不定胆：不限顺序，开奖号中包含所选号，即为中奖。': [],
    '直选：选择三个数字投注，顺序一致。将投注号码以唯一的排列方式进行投注。': [],
    '组选三：选择三个数字投注，顺序不限，但投注的三位号码有两位相同（对子）。有2个数字相同的3个数字有3种不同的排列方式，即1次投注有3个中奖机会，这种投注方式为组选三。示例：112，排列方式有112、121、211。': [],
    '组选六：选择三个数字投注，顺序不限，且投注的三位号码各不相同。3个不同的数字有6种不同的排列方式，即1次投注有6个中奖机会，这种投注方式为组选六。示例：123，排列方式有123、132、213、231、312、321。': [],
  },
  'PK10': {},
  'PC蛋蛋': {
    '混合：指对开奖特码的形态进行投注，形态号码如下': [
      '大小：14~21为大，6~13为小',
      '极大小：22~27为极大，0~5为极小',
  ],
    '波色：指对开奖特码的波色进行投注，波色号码如下：': [
      '绿波号码：1、4、7、10、16、19、22、25',
      '蓝波号码：2、5、8、11、17、20、23、26',
      '红波号码：3、6、9、12、15、18、21、24',
      '灰波号码：0、13、14、27（若开出灰波号码，则投注任何波色均视为不中奖。）',
  ],
  },
  '六合彩': {
    '特码大小单双': [
      '特大：开出的特码在25~48范围内。',
      '特小：开出的特码在01~24范围内。',
      '特双：特码为双数，如18、20、34、42。',
      '特单：特码为单数，如01、11、35、47。',
      '和局：当期开出的特码为49时，视为和局，自动返还投注本金。',
    ],
    '特码合数大小单双': [
      '和大：指特码的个位加上十位之和大于等于7，如26、45、36。',
      '和小：指特码的个位与十位相加之和小于等于6，如30、14、22。',
      '和双：指特码的个位加上十位之和为“双数”，如02、11、33、44。',
      '和单：指特码的个位加上十位之和为“单数”，如01、14、36、47。',
      '和局：当期开出的特码为49时，视为和局，自动返还投注本金。',
    ],
    '特码尾数大小': [
      '特尾大：5尾~9尾为大，如05、18、19。',
      '特尾小：0尾~4尾为小，如01、32、44。',
      '和局：当期开出的特码为49时，视为和局，自动返还投注本金。',
    ],
    '总和大小单双': [
      '总和大：当期开奖号码的7个号码相加之和大于或等于175。',
      '总和小：当期开奖号码的7个号码相加之和小于或等于174。',
      '总和单：当期开奖号码的7个号码相加之和为奇数。',
      '总和双：当期开奖号码的7个号码相加之和为偶数。',
    ],
    '生肖，顺序为 鼠 >牛 >虎 >兔 >龙 >蛇 >马 >羊 >猴 >鸡 >狗 >猪 ，如今年是鸡年，则以鸡开始，依顺序将49个号码分为12个生肖，具体如下（注：生肖中49亦算输赢，不为和。）：': [
      '鸡：01、13、25、37、49',
      '猴：02、14、26、38',
      '羊：03、15、27、39',
      '马：04、16、28、40',
      '蛇：05、17、29、41',
      '龙：06、18、30、42',
      '兔：07、19、31、43',
      '虎：08、20、32、44',
      '牛：09、21、33、45',
      '鼠：10、22、34、46',
      '豬：11、23、35、47',
      '狗：12、24、36、48',
    ],
    '色波，指49个号码球分别有红、蓝、绿三种颜色，以特码开出的颜色和投注的颜色相同视为中奖，颜色代表如下：': [
      '红波：01、02、07、08、12、13、18、19、23、24、29、30、34、35、40、45、46',
      '蓝波：03、04、09、10、14、15、20、25、26、31、36、37、41、42、47、48',
      '绿波：05、06、11、16、17、21、22、27、28、32、33、38、39、43、44、49',
    ],
    '特码头数：': [
      '"0"头：01、02、03、04、05、06、07、08、09',
      '"1"头：10、11、12、13、14、15、16、17、18、19',
      '"2"头：20、21、22、23、24、25、26、27、28、29',
      '"3"头：30、31、32、33、34、35、36、37、38、39',
      '"4"头：40、41、42、43、44、45、46、47、48、49',
    ],
    '特码尾数：': [
      '"0"尾：10、20、30、40',
      '"1"尾：01、11、21、31、41',
      '"2"尾：02、12、22、32、42',
      '"3"尾：03、13、23、33、43',
      '"4"尾：04、14、24、34、44',
      '"5"尾：05、15、25、35、45',
      '"6"尾：06、16、26、36、46',
      '"7"尾：07、17、27、37、47',
      '"8"尾：08、18、28、38、48',
      '"9"尾：09、19、29、39、49',
    ],
    '五行：': [
      '金：03、04、17、18、25、26、33、34、47、48',
      '木：07、08、15、16、29、30、37、38、45、46',
      '水：05、06、13、14、21、22、35、36、43、44',
      '火： 01、02、09、10、23、24、31、32、39、40',
      '土： 11、12、19、20、27、28、41、42、49',
    ],
  },
}

export const RULE_DETAIL = {
  '时时彩': {
    '五星': {
      '五星-直选':
        {
          '复式': '从万千百十个位各选1个号码组成一注。所选号与开奖号相同，且顺序一致，即为中奖。',
          '单式': '手动输入1个五位数号码组成一注。输入号与开奖号相同，且顺序一致，即为中奖。',
          '组合': '从万、千、百、十、个位中各选1个号码组成1-5星组合，共5注。所选号的个位与开奖号个位相同，则中1个5等奖；所选号的十、个位与开奖号十、个位相同，则中1个5等奖和4等奖，以此类推，最高可中5个奖。如所选号个位不中奖，则余号均视为不中奖。',
        },
      '五星-组选': {
        '组选120': '从0-9中任选5个号码组成一注。不限顺序，开奖号中包含全部所选号，即为中奖。',
        '组选60': '选1个二重号，3个单号组成一注。不限顺序，开奖号中包含全部所选号，且二重号出现2次，即为中奖。',
        '组选30': '选2个二重号，1个单号组成一注。不限顺序，开奖号中包含全部所选号，且2个二重号各出现2次，即为中奖。',
        '组选20': '选1个三重号，2个单号组成一注。不限顺序，开奖号中包含全部所选号，且三重号出现3次，即为中奖。',
        '组选10': '从三重号和二重号中各选1个号码组成一注。不限顺序，开奖号中所选的三重号出现3次，二重号出现2次，即为中奖。',
        '组选5': '选1个四重号，1个单号组成一注。不限顺序，开奖号中包含全部所选号，且四重号出现4次，即为中奖。',
      },
    },
    '四星': {
      '后四-直选': {
        '复式': '从千、百、十、个位中各选1个号码组成一注。所选号与开奖号后四位号码相同，且顺序一致，即为中奖。',
        '单式': '手动输入1个四位数号码组成一注。输入号与开奖号后四位号码相同，且顺序一致，即为中奖。',
        '组合': '从千、百、十、个位中各选1个号码组成1-4星组合，共4注。所选号的个位与开奖号个位相同，则中1个4等奖；所选号的十、个位与开奖号十、个位相同，则中1个4等奖和3等奖，以此类推，最高可中4个奖。如所选号个位不中奖，则余号均视为不中奖。',
      },
      '后四-组选': {
        '组选24': '从0-9中任选4个号码组成一注。不限顺序，开奖号后四位中包含全部所选号，即为中奖。',
        '组选12': '选1个二重号，2个单号组成一注。不限顺序，开奖号后四位中包含全部所选号，且二重号出现2次，即为中奖。',
        '组选6': '选2个二重号组成一注。不限顺序，开奖号后四位中2个二重号各出现2次，即为中奖。',
        '组选4': '选1个三重号，1个单号组成一注。不限顺序，开奖号后四位中包含全部所选号，且三重号出现3次，即为中奖。',
      },
      '前四-直选': {
        '复式': '从万、千、百、十位中各选1个号码组成一注。所选号与开奖号前四位相同，且顺序一致，即为中奖。',
        '单式': '手动输入1个四位数号码组成一注。所选号与开奖号前四位相同，且顺序一致，即为中奖。',
        '组合': '从万、千、百、十位中各选1个号码组成1-4星组合，共4注。所选号的十位与开奖号十位相同，则中1个4等奖；所选号的百、十位与开奖号百、十位相同，则中1个4等奖和3等奖，以此类推，最高可中4个奖。如所选号十位不中奖，则余号均视为不中奖。',
      },
      '前四-组选': {
        '组选24': '从0-9中任选4个号码组成一注。不限顺序，开奖号前四位中包含全部所选号，即为中奖。',
        '组选12': '选1个二重号，2个单号组成一注。不限顺序，开奖号前四位中包含全部所选号，且二重号出现2次，即为中奖。',
        '组选6': '选2个二重号组成一注。不限顺序，开奖号前四位中2个二重号各出现2次，即为中奖。',
        '组选4': '选1个三重号，1个单号组成一注。不限顺序，开奖号前四位中包含全部所选号，且三重号出现3次，即为中奖。',
      },
    },
    '三星': {
      '后三-直选': {
        '复式': '从百、十、个位中各选1个号码组成一注。所选号与开奖号后三位相同，且顺序一致，即为中奖。',
        '单式': '手动输入1个三位数号码组成一注。输入号与开奖号后三位相同，且顺序一致，即为中奖。',
        '和值': '从0-27中任选1个号码组成一注。所选号数值等于开奖号后三位数相加之和，即为中奖。',
      },
      '后三-组选': {
        '组三': '从0-9中任选2个号码组成两注。不限顺序，开奖号后三位中包含全部所选号，且其中一个所选号出现2次，即为中奖。',
        '组六': '任选3个不同的号码组成一注。不限顺序，开奖号后三位中包含全部所选号，即为中奖。',
        '混合组选': '手动输入1个三位数号码（不含豹子号）组成一注。其中1个所选号在开奖号后三位中出现2次，则中组三奖；开奖号后三位中包含全部所选号，且无重复号码出现，则中组六奖。',
      },
      '中三-直选': {
        '复式': '从千、百、十位中各选1个号码组成一注。所选号与开奖号中间三位号码相同，且顺序一致，即为中奖。',
        '单式': '手动输入1个三位数号码组成一注。所选号与开奖号中间三位号码相同，且顺序一致，即为中奖。',
        '和值': '从0-27中任选1个号码组成一注。所选号数值等于开奖号中间三位数相加之和，即为中奖。',
      },
      '中三-组选': {
        '组三': '任选2个号码组成一注。开奖号中间三位中包含全部所选号，且其中一个号出现2次，即为中奖。',
        '组六': '任选3个不同的号码组成一注。开奖号中间三位中包含全部所选号，即为中奖。',
        '混合组选': '手动输入1个三位数号码（不含豹子号）组成一注。其中1个输入号在开奖号中间三位里出现2次，则中组三奖；开奖号中间三位中包含全部输入号，且无重复号码出现，则中组六奖。',
      },
      '前三-直选': {
        '复式': '从万、千、百位各选1个号码组成一注。所选号与开奖号前三位号码相同，且顺序一致，即为中奖。',
        '单式': '手动输入1个三位数号码组成一注。输入号与开奖号前三位号码相同，且顺序一致，即为中奖。',
        '和值': '从0-27中任选1个号码组成一注。所选号数值等于开奖号前三位数相加之和，即为中奖。',
      },
      '前三-组选': {
        '组三': '任选2个号码组成一注。不限顺序，开奖号前三位中包含全部所选号，且其中一个号码出现2次，即为中奖。',
        '组六': '任选3个不同的号码组成一注。不限顺序，开奖号前三位中包含全部所选号，即为中奖。',
        '混合组选': '手动输入1个三位数号码（不含豹子号）组成一注。其中1个输入号在开奖号前三位中出现2次，则中组三奖；开奖号前三位中包含全部输入号，且无重复号码出现，则中组六奖。',
      },
    },
    '二星': {
      '后二-直选': {
        '复式': '从十、个位中各选1个号码组成一注。所选号与开奖号后二位号码相同，且顺序一致，即为中奖。',
        '单式': '手动输入1个两位数号码组成一注。输入号与开奖号后两位号码相同，且顺序一致，即为中奖。',
        '和值': '从0-18中任选1个号码组成一注。所选号数值等于开奖号后两位数相加之和，即为中奖。',
        '大小单双': '从十位、个位的大（5~9）小（0~4）单双中各选1个形态组成一注。所选位置和形态与开奖号的十、个位形态相同，即为中奖。',
      },
      '后二-组选': {
        '复式': '从0-9中任选2个号码组成一注。不限顺序，开奖号后两位数中包含所选号，即为中奖。',
        '单式': '手动输入1个两位数号码组成一注。不限顺序，开奖号后两位数中包含所选号即为中奖。',
      },
      '前二-直选': {
        '复式': '从万、千位中各选1个号码组成一注。所选号与开奖号前两位号码相同，且顺序一致，即为中奖。',
        '单式': '手动输入1个两位数号码组成一注。输入号与开奖号前两位号码相同，且顺序一致，即为中奖。',
        '和值': '从0-18中任选1个号码组成一注。所选号数值等于开奖号前两位数相加之和，即为中奖。',
        '大小单双': '从万位、千位的大小单双中各选1个形态组成一注。所选位置和形态与开奖号的万、千位形态相同，即为中奖。',
      },
      '前二-组选': {
        '复式': '从0-9中任选2个号码，不限顺序，开奖号前两位数中包含所选号，即为中奖。',
        '单式': '手动输入1个两位数号码，不限顺序，开奖号前两位数中包含所选号，即为中奖。',
      },
    },
    '一星': {
      '定位胆': {'': '从万、千、百、十、个位中的任意一个位置上选1个号码，所选号与相同位置上的开奖号一致，即为中奖。'},
    },
    '不定胆': {
      '三星-不定胆一码': {'': '从0-9中任选1个号码，对应规则指定的三个位置，不限顺序，开奖号中包含所选号，即为中奖。'},
      '三星-不定胆二码': {'': '从0-9中任选2个号码，对应规则指定的三个位置，不限顺序，开奖号中包含全部所选号，即为中奖。'},
    },
    '任选': {
      '任二': {
        '复式': '任选2个位置并各选1个号码组成一注。所选2个位置上的开奖号与全部所选号相同，且顺序一致，即为中奖。',
        '单式': '手动勾选任意2个位置，并输入1个两位数号码组成一注。所选2个位置上的开奖号与全部输入号相同，且顺序一致，即为中奖。',
        '组选': '任选2个位置并各选1个号码组成一注。不限顺序，所选2个位置上的开奖号中包含全部所选号，即为中奖。',
      },
      '任三': {
        '复式': '任选3个位置并各选1个号码组成一注。所选3个位置上的开奖号与所选号相同，且顺序一致，即为中奖。',
        '单式': '手动勾选任意3个位置，并输入1个三位数号码组成一注。所选3个位置上的开奖号与全部输入号相同，且顺序一致，即为中奖。',
        '组三': '手动勾选任意3个位置，并从0-9中任选2个号码组成一注。不限顺序，所选3个位置上的开奖号中包含全部所选号，且其中一个号码出现两次，即为中奖。',
        '组六': '手动勾选任意3个位置，并从0-9中任选3个不同的号码组成一注。不限顺序，所选3个位置上的开奖号中包含全部所选号，即为中奖。',
        '混合组选': '勾选任意3个位置，并手动输入1个三位数号码（不含豹子号）组成一注。不限顺序，所选3个位置上的开奖号中包含全部输入号，且其中一个号码出现2次，则中组三奖；不限顺序，所选3个位置上的开奖号与全部输入号相同，则中组六奖。',
      },
      '任四': {
        '复式': '任选4个位置并各选1个号码组成一注。所选4个位置上的开奖号与全部所选号相同，且顺序一致，即为中奖。',
        '单式': '手动勾选4个位置，并输入1位四位数号码组成一注。所选4个位置上的开奖号与全部输入号相同，且顺序一致，即为中奖。',
      },
      '跨度': {'': '从0-9中任选1个号码，所选号数值等于规则指定的位置上的开奖号最大最小数字差值，即为中奖。'},
    },
    '趣味': {
      '特殊': {
        '一帆风顺': '从0-9中任选1个号码组成一注。不限顺序，开奖号中包含所选号，即为中奖。',
        '好事成双': '从0-9中任选1个二重号组成一注。所选号在开奖号中出现2次，即为中奖。',
        '三星报喜': '从0-9中任选1个三重号组成一注。所选号在开奖号中出现3次，即为中奖。',
        '四季发财': '从0-9中任选1个四重号组成一注。所选号在开奖号中出现4次，即为中奖。',
      },
      '龙虎': {
        '万千': '任选1个形态组成一注。根据万位和千位的数字比大小，万位号码大于千位号码则为龙，小于则为虎，相同则为和。',
        '万百': '任选1个形态组成一注。根据万位和百位的数字比大小，万位号码大于百位号码则为龙，小于则为虎，相同则为和。',
        '万十': '任选1个形态组成一注。根据万位和十位的数字比大小，万位号码大于十位号码则为龙，小于则为虎，相同则为和。',
        '万个': '任选1个形态组成一注。根据万位和个位的数字比大小，万位号码大于个位号码则为龙，小于则为虎，相同则为和。',
        '千百': '任选1个形态组成一注。根据千位和百位的数字比大小，千位号码大于百位号码则为龙，小于则为虎，相同则为和。',
        '千十': '任选1个形态组成一注。根据千位和十位的数字比大小，千位号码大于十位号码则为龙，小于则为虎，相同则为和。',
        '千个': '任选1个形态组成一注。根据千位和个位的数字比大小，千位号码大于个位号码则为龙，小于则为虎，相同则为和。',
        '百十': '任选1个形态组成一注。根据百位和十位的数字比大小，百位号码大于十位号码则为龙，小于则为虎，相同则为和。',
        '百个': '任选1个形态组成一注。根据百位和个位的数字比大小，百位号码大于个位号码则为龙，小于则为虎，相同则为和。',
        '十个': '任选1个形态组成一注。根据十位和个位的数字比大小，十位号码大于个位号码则为龙，小于则为虎，相同则为和。',
      },
    },
  },
  '快3': {
    '二不同号': {
      '二不同号': {'': '从1-6中任选2个不相同的号码组成一注。不限顺序，开奖号中包含全部所选号，即为中奖。'},
    },
    '二同号': {
      '单选': {'': '从二同号和不同号中各选1个号码组成一注。不限顺序，开奖号中包含全部所选号，即为中奖。'},
      '复选': {'': '从6组对子中任选1组对子号码组成一注。不含豹子号码，开奖号中包含所选的对子号码，即为中奖。'},
    },
    '三不同号': {
      '三不同号': {'': '从1-6中任选3个不相同的号码组成一注。不限顺序，所选号与开奖号相同，即为中奖。'},
    },
    '三同号': {
      '单选': {'': '选任意一组豹子号码组成一注。所选号与开奖号相同，即为中奖。'},
      '三同号-通选': {'': '对6组豹子号码进行通选投注。开奖号与6组豹子号中任意一组号码相同，即为中奖。'},
    },
    '三连号-通选': {
      '三连号-通选': {'': '对4组三连号进行通选投注。开奖号与4组三连号中任意一组号码相同，即为中奖。'},
    },
    '和值': {
      '和值': {'': '从3-18中任选1个号码组成一注。所选号等于开奖号的3个号码相加之和，即为中奖。'},
    },
  },
  '11选5': {
    '三码': {
      '前三直选-复式': {'': '从第一、二、三位中各选1个不同的号码组成一注。所选号与开奖号前三位号码相同，且顺序一致，即为中奖。'},
      '前三组选-复式': {'': '从01-11中任选3个不同的号码组成一注。不限顺序，开奖号前三位中包含全部所选号，即为中奖。'},
    },
    '二码': {
      '前二直选': {'': '从第一、二位中各选1个不同的号码组成一注。所选号与开奖号前两位号码相同，且顺序一致，即为中奖。'},
      '前二组选': {'': '从01-11中任选2个不同的号码组成一注。不限顺序，开奖号前两位中包含全部所选号，即为中奖。'},
    },
    '不定胆': {
      '前三位': {'': '从01-11中任选1个号码组成一注。不限顺序，开奖号前三位任意一位中包含所选号，即为中奖。'},
    },
    '定位胆': {
      '定位胆': {'': '从第一位至第五位中任选1个位置，并选1个号码组成一注。投注号与开奖号位置及号码相同，即为中奖。'},
    },
    '任选': {
      '一中一': {'': '从01-11中任选1个号码组成一注。不限顺序，开奖号中包含全部所选号，即为中奖。'},
      '二中二': {'': '从01-11中任选2个号码组成一注。不限顺序，开奖号中包含全部所选号，即为中奖。'},
      '三中三': {'': '从01-11中任选3个号码组成一注。不限顺序，开奖号中包含全部所选号，即为中奖。'},
      '四中四': {'': '从01-11中任选4个号码组成一注。不限顺序，开奖号中包含全部所选号，即为中奖。'},
      '五中五': {'': '从01-11中任选5个号码组成一注。不限顺序，开奖号中包含全部所选号，即为中奖。'},
      '六中五': {'': '从01-11中任选6个号码组成一注。不限顺序，开奖号中包含6个所选号中的任意5个号码，即为中奖。'},
      '七中五': {'': '从01-11中任选7个号码组成一注。不限顺序，开奖号中包含7个所选号中的任意5个号码，即为中奖。'},
      '八中五': {'': '从01-11中任选8个号码组成一注。不限顺序，开奖号中包含8个所选号中的任意5个号码，即为中奖。'},
    },
  },
  '低频彩': {
    '三码': {
      '直选-复式': {'': '从百、十、个位各选1个号码组成一注。所选号与开奖号相同，且顺序一致，即为中奖。'},
      '直选-和值': {'': '从0-27中任选1个号码组成一注。所选号等于开奖号的三个号码相加之和，即为中奖。'},
      '组选-组三': {'': '从0-9中任选2个号码组成一注。不限顺序，开奖号中包含全部所选号，且其中一个号码出现2次，即为中奖。'},
      '组选-组六': {'': '从0-9中任选3个号码进行投注。不限顺序，开奖号中包含全部所选号，即为中奖。'},
      '组选-混合': {'': '手动输入1个三位数号码组成一注。开奖号中包含输入的3个号码，其中一个输入号出现两次，则中组三奖，三个号码均无重复，则中组六奖。'},
    },
    '二码': {
      '后二码-直选复式': {'': '从十、个位中各选1个号码组成一注。所选号与开奖号十、个位号码相同，且顺序一致，即为中奖。'},
      '后二码-直选和值': {'': '从0-18中任选1个号码组成一注。所选号等于开奖号十、个位两个号码相加之和，即为中奖。'},
      '后二码-组选复式': {'': '从0-9中任选2个号码组成一注。不限顺序，所选号与开奖号十、个位相同，即为中奖。'},
      '前二码-直选复式': {'': '从百、十位中各选1个号码组成一注。所选号与开奖号百、十位号码相同，且顺序一致，即为中奖。'},
      '前二码-直选和值': {'': '从0-18中任选1个号码组成一注。所选号等于开奖号百、十位两个号码相加之和，即为中奖。'},
      '前二码-组选复式': {'': '从0-9中任选2个号码组成一注。不限顺序，开奖号百、十位中包含全部所选号，即为中奖。'},
      '定位胆': {'': '任选1个位置并选1个号码组成一注。所选号与相同位置上的开奖号一致，即为中奖。'},
      '不定胆-一码不定胆': {'': '从0-9中任选1个号码组成一注。不限顺序，开奖号中包含全部所选号，即为中奖。'},
    },
  },
  'PK10': {
    '前一': {
      '前一': {'': '从01-10中任选1个号码组成一注。所选号与开奖号第一位相同，即为中奖。'},
    },
    '前二': {
      '前二': {'': '从第一位、第二位中各选1个不同的号码组成一注。所选号与开奖号前两位号码相同，且顺序一致，即为中奖。'},
    },
    '前三': {
      '前三': {'': '从第一位至第三位中各选1个不同的号码组成一注。所选号与开奖号前三位号码相同，且顺序一致，即为中奖。'},
    },
    '定位胆': {
      '定位胆': {'': '从任意位置上选1个号码进行投注。所选号与相同位置上的开奖号一致，即为中奖。'},
    },
    '大小单双': {
      '大小单双': {'': '对第一名、第二名、第三名的车号进行大（6~10）、小（1~5）、单、双投注。所选形态与相同位置上的开奖号形态一致，即为中奖。'},
    },
    '冠亚和': {
      '大小单双': {'': '对冠、亚军车号相加之和的大（12~19）小（3~11）单双进行投注。所选形态符合开奖号冠、亚军车号相加之和，即为中奖。'},
      '冠亚和值': {'': '从3-19中任选1个号码组成一注。所选号等于开奖号冠、亚军车号相加之和，即为中奖。'},
    },
  },
  'PC蛋蛋': {
    '混合': {
      '混合': {'': '对特码的大（14-27）、小（0-13）、单、双、极大（22-27）、极小（0-5）形态进行投注，任选1个形态组成一注。所选形态与开奖特码的形态相同，即为中奖。'},
    },
    '波色': {
      '波色': {'': '对开奖特码的波色进行投注，任选1个波色组成一注。所选波色与开奖特码波色相同，即为中奖。如开出灰波（0、13、14、27）则投注任何波色均视为不中奖。'},
    },
    '豹子': {
      '豹子': {'': '投注当期的3个开奖号为豹子号码。3个开奖号码为同一号码，即为中奖。'},
    },
    '特码包三': {
      '特码包三': {'': '对开奖特码进行投注，任选3个号码组成一注。所选的3个号码中任一号码与开奖特码相同，即为中奖。'},
    },
    '特码': {
      '特码': {'': '对开奖特码进行投注，任选1个号码组成一注。所选号与开奖特码相同，即为中奖。'},
    },
  },
  '六合彩': {
    '两面': {
      '两面': {'': '指大小单双。对特码的总和及形态或正码1-6的合数及形态进行投注。所选号与开奖号的位置、形态相同，即为中奖。'},
    },
    '特码AB': {
      '特码AB': {'': '1个号码组成一注，投注特码与开奖特码相同，即为中奖。特码A：不计输赢，均设有返水优惠；特码B：无返水优惠。'},
    },
    '正码': {
      '正码': {'': '从01-49中任选1个号码组成一注。不限顺序，开奖的正码中包含投注号，即为中奖。'},
    },
    '正码特': {
      '正码特': {'': '指正1特至正6特，任选1个号码组成一注。投注号与开奖的正码号码及位置相同，即为中奖。'},
    },
    '正码1-6': {
      '正码1-6': {'': '任选1个形态组成一注。投注号与开奖号的正码位置、形态相同，即为中奖。'},
      '大小': {'': '指定出现正码的位置与号码大于或等于25为大，小于或等于24为小，开出49为和。'},
      '单双': {'': '以指定出现正码的位置与号码为单数或双数下注，开出49为和。'},
      '合数大小': {'': '以指定出现正码的位置与号码个位和十位的数字和值来判断大小，合数大于或等于7为大，小于或等于6为小。'},
      '合数单双': {'': '以指定出现正码的位置与号码个位和十位数字和值来判断单双。'},
      '色波': {'': '以指定出现正码的位置的球色下注，开奖的球色与下注的颜色相同，即为中奖。'},
      '尾数大小': {'': '以指定出现正码的位置与号码尾数大小下注，0尾~4尾为小、5尾~9尾为大。'},
    },
    '正码过关': {
      '正码过关': {'': '从正一至正六中任选2个位置，并各选1个形态组成一注。所选形态与相同位置上的开奖形态一致，即为中奖。可同时选投多个正码形态，串联成投注组合，赔率为所选串联赔率的总乘积。'},
    },
    '连码': {
      '四全中': {'': '对开奖正码进行投注，任选4个号码为一注。不限顺序，开奖正码中包含4个所选号，即为中奖。'},
      '三全中': {'': '对开奖正码进行投注，任选3个号码为一注。不限顺序，开奖正码中包含3个所选号，即为中奖。'},
      '三中二': {'': '对开奖正码进行投注，任选3个号码为一 注。不限顺序，开奖正码中包含所选号中的任意2个号码，即中“三中二”；正码中包含3个所选号，即中“三中二之中三”。'},
      '二全中': {'': '对开奖正码进行投注，任选2个号码为一注。不限顺序，开奖正码中包含2个所选号，即为中奖。'},
      '二中特': {'': '从01-49中任选2个号码为一注。开奖正码中包含2个所选号，则中“二中特之中二”；若所选号中1个是正码，1个是特码，则中“二全中之中特”。'},
      '特串': {'': '从01-49中任选2个号码为一注。2个所选号一个出现在开奖正码中，一个出现在开奖特码中，即为中奖。'},
    },
    '连肖': {
      '连肖': {'': '对7个开奖号码所属的生肖进行投注。不限顺序，7个开奖号中包含全部所选生肖，即为中奖。'},
    },
    '连尾': {
      '连尾': {'': '对7个开奖号的尾数进行投注。不限顺序，7个开奖号的尾数中包含全部所选尾号，即为中奖。'},
    },
    '自选不中': {
      '自选不中': {'': '7个开奖号中均不包含全部所选号，即为中奖。'},
    },
    '生肖': {
      '十二肖': {'': '对开奖特码所属的生肖进行投注，任选1个生肖为一注。开奖特码在所选生肖范围内，即为中奖。'},
      '正肖': {'': '对6个开奖正码所属的生肖进行投注，任选1个生肖组成一注。不限顺序，6个开奖正码中任意1个号码在所选生肖范围内，即为中奖。若有N个开奖正码在所选生肖范围内，中奖金额=投注金额*（1+赔率*N）。'},
      '一肖': {'': '对7个开奖号码所属的生肖范围进行投注，任选1个生肖为一注。7个开奖号中任意一个号码在所选生肖的范围内，即为中奖。'},
      '总肖': {'': '对7个开奖号的不同生肖总数及总肖的单双形态进行投注，任选1个组成一注。总肖单双指7个开奖号所属的生肖总数为单数或双数。投注类型与7个开奖号类型相符，即为中奖。'},
    },
    '合肖': {
      '中': {'': '对开奖特码所属生肖进行投注，任选1个生肖为一注。开奖特码在所选生肖范围内，即为中奖。'},
      '不中': {'': '对开奖特码不在下注的生肖范围内进行投注，任选1个生肖为一注。开奖的特码范围不在所选生肖内，即为中奖。'},
    },
    '色波': {
      '三色波': {'': '对开奖特码的色波进行投注，任选1个色波为一注。所选波色与开奖特码的色波相同，即为中奖。'},
      '半波': {'': '以开奖特码的色波和大小单双为一个组合，任选1个组合为一注。所选组合与开奖特码相符，即为中奖。如开奖特码为49，则为和局，系统自动退还投注金额。'},
      '半半波': {'': '以开奖特码的色波和大单大双小单小双为一个组合，任选1个组合为一注。所选组合与开奖特码相符，即为中奖。如开奖号特码为49，则为和局，系统自动退还投注金额。'},
      '七色波': {'': `以7个开奖号的色波，哪个颜色最多为中奖色波。7个开奖号最多的色波与所选色波相同，即为中奖。以下3种结果视为和局：
6个正码开出3蓝3绿，特码是1.5红
6个正码开出3蓝3红，特码是1.5绿
6个正码开出3绿3红，特码是1.5蓝
如投注红、蓝、绿波时开出和局，则系统自动退还投注金额；会员也可以下注“和局”。`},
    },
    '尾数': {
      '头尾数': {'': '对开奖特码头（十位）或尾（个位）数进行投注，任选1个类型为一注。所选的头数或尾数与开奖特码位置、号码相同，即为中奖。'},
      '正特尾数': {'': '对6个正码的尾数进行投注，任选1个类型为一注。6个正码中任意一个尾数与所选尾数相同，即为中奖。'},
    },
    '七码五行': {
      '七码': {'': '对7个开奖号中大小单双各有多少个进行投注，任选1个类型为一注。所选的大小单双数量与7个开奖号的大小单双数量相同，即为中奖。'},
      '五行': {'': '对开奖特码所属的五行进行投注，任选1个为一注。开奖特码在所选的五行范围内，即为中奖。'},
    },
    '中一': {
      '中一': {'': '对应不同的选号数量要求，所选号码在当期7个开奖号码中出现任意1个，即为中奖，出现2个或以上所选号，则不中奖。'},
    },
  },
}
